#   -*- mode: org; fill-column: 60 -*-

#+TITLE: Hydra  | Deerpig's Dot Emacs
#+AUTHOR: Brad Collins
#+EMAIL: brad@chenla.la
#+STARTUP: showall
#+TOC: headlines 4
#+PROPERTY: header-args    :results drawer  :tangle emacs-hydra.el
:PROPERTIES:
:CUSTOM_ID: 
:Name:      /home/deerpig/proj/deerpig/dot-emacs/dot-hydra.org
:Created:   2017-07-02T17:53@Prek Leap (11.642600N-104.919210W)
:ID:        c100a1f4-b059-4ec4-84b7-1c899db2a444
:VER:       552264872.722684514
:GEO:       48P-491193-1287029-15
:BXID:      pig:HAQ2-5424
:Class:     dotemacs
:Type:      literate-program
:Status:    wip
:Licence:   MIT/CC BY-SA 4.0
:END:

[[https://img.shields.io/badge/made%20by-Deerpig-999999.svg?style=flat-square]] 
[[https://img.shields.io/badge/class-dotemacs-0072B2.svg?style=flat-square]]
[[https://img.shields.io/badge/type-literate%20program-0072B2.svg?style=flat-square]]
[[https://img.shields.io/badge/status-wip-D55E00.svg?style=flat-square]]
[[https://img.shields.io/badge/licence-MIT%2FCC%20BY--SA%204.0-000000.svg?style=flat-square]]

* Introduction

I was late to drink the hydra cool-aid.  It always sounded like a
great idea, but it just didn't click until recently.

Like many Emacs folks, over the years I have written any number of
functions that provided insert stuff.  And other functions to provide
menus to insert stuff -- especially unicode characters that I can't
remember the names of.

I've pretty replaced much all of the insert functions (or will soon)
replaced them using yasnippet and Helm provides a great interface to
inserting snippets, but this doesn't help to insert obscure unicode
characters.  That was my in for Hydra.

Since then, I realized that since I there are any number of Emacs
commands that I use, but use infrequently enough that I don't remember
the commands.  This is especially true for things like Twittering Mode
that as a huge number of powerful commands which I keep in a cheat sheet.
But Twit i just an example.  Calc, Rectangle Mode, Window Management,
etc. all fall into the same category.

  - [[https://en.wikipedia.org/wiki/Box_Drawing][Unicode Box Drawing Characters]] - Wikipedia


* Hydras

** File Header
:PROPERTIES:
:ID:       184c2ad9-3f3f-41d0-8c7f-7b059620b02d
:END:

#+begin_src emacs-lisp
;; -*- mode: EMACS-LISP; fill-column: 75; comment-column: 50; -*-
;; Emacs Hydra Files
#+end_src
** Hydra Package
:PROPERTIES:
:ID:       8a83fa27-13ae-4ba6-94c1-d7725dd08564
:END:

Homepage:  [[https://github.com/abo-abo/hydra#awesome-docstring][Hydra | Github]]

Install the Hydra Package:

#+begin_src emacs-lisp
;; Hydra ===============================================
;; See https://github.com/abo-abo/hydra#awesome-docstring

(use-package hydra
  :ensure t  
  :config
(require 'hydra-examples) ;; needed for hydra-move-splitter
)
#+end_src

#+RESULTS:
: t

** Key Chords
:PROPERTIES:
:ID:       32489c4b-f058-4da0-a2ba-1662de184fa2
:END:

The biggest challenge with Hydra is coming up with key-bindings for
each Hydra and then remembering those key-bindings... This is a
non-trivial problem.

This is where key chords come on.  I first tried key chords a few
years ago, but quickly found that if you aren't /very/ careful, they
get invoked when you type quickly.  Playing with delay settings for
chords didn't really help much.  I spent weeks trying any number of
combinations -- but still ended up invoking chords when I typed.  I
finally hit on the idea of using key-patterns rather than memnomic key
combinations.  It's not difficult to remember a shape of something.
This is where I got the idea for using horizontal key-chords.

#+begin_example
1 2 3 4 5 6 7 8 9 0 - =
 q w e r t y u i o p [ ]
  a s d f g h j k l ; ' 
#+end_example

On a standard keyboard with staggered rows of keys it's very easy to
press keys on two rows at the same time with one hand.  This gives you
combinations including /1q/, /5t/ or /8i/.  You just have to remember
the number or the letter and you get the companion character for free.
This works well for the top two rows, as well as the top row and the
third row (eg. /1a/, /3d/, /6h/).  I suppose if you exhaust those, you
can start using triple-key chords eg. /1qa/, /2ws/, /3ed/....  I hope
it won't come to that :)

#+begin_src emacs-lisp

;; Key Chords ==============================================

(use-package key-chord
  :ensure t
  :init
  (progn
   ;; (fset 'key-chord-define 'my/key-chord-define)
    (setq key-chord-one-key-delay 0.16)
    (setq key-chord-two-key-delay 0.16)
    (key-chord-mode 1)
    (key-chord-define-global "1q"     'hydra-badge/body)
    (key-chord-define-global "2w"     'hydra-window/body)
    (key-chord-define-global "3e"     'hydra-org/body)
    (key-chord-define-global "4r"     'hydra-rectangle/body)
    (key-chord-define-global "5t"     'hydra-twittering/body)
    (key-chord-define-global "6y"     'hydra-org/body)
    (key-chord-define-global "7u"     'hydra-unicode/body)
    (key-chord-define-global "8i"     'hydra-logic/body)
    (key-chord-define-global "9o"     'hydra-greek/body)
    (key-chord-define-global "0p"     'hydra-calendar/body)
    (key-chord-define-global "qa"     'org-ref-bibtex-hydra/body)
    (key-chord-define-global "ws"     'hydra-pdftools/body)
    (key-chord-define-global "tg"     'help/hydra/timestamp/body)
    (key-chord-define-global "ed"     'hydra-macron/body)
    )) 

;; Key Bindings ============================================
    ;; set same hydras using super key which is maped to Caps_Lock
    (global-set-key (kbd "s-1") 'hydra-badge/body)
    (global-set-key (kbd "s-2") 'hydra-window/body)
    (global-set-key (kbd "s-3") 'hydra-org/body)
    (global-set-key (kbd "s-4") 'hydra-rectangle/body)
    (global-set-key (kbd "s-5") 'hydra-twittering/body)
    (global-set-key (kbd "s-6") 'hydra-org/body)
    (global-set-key (kbd "s-7") 'hydra-unicode/body)
    (global-set-key (kbd "s-8") 'hydra-logic/body)
    (global-set-key (kbd "s-9") 'hydra-greek/body)
    (global-set-key (kbd "s-0") 'hydra-calendar/body)
    (global-set-key (kbd "s-a") 'org-ref-bibtex-hydra-key-binding)
#+end_src

#+RESULTS:
:RESULTS:
org-ref-bibtex-hydra-key-binding
:END:


** Window Management Hydra
:PROPERTIES:
:ID:       2a8a0da9-0d9b-4ada-8bd0-0dde7d2fd957
:END:

I use /Bunsen Labs Linux/ (formally known as CrunchBang Linux)
which is Debian running OpenBox window manager with some very nice
integration and customization.  Openbox allows you do do practically
all window management using the keyboard.  I bind all window moving
and resizing commands using the <WIN> (windows key).  Once I've opened
emacs I can resize the frame using Openbox as I want it.  But after
that all windows within the emacs frame must be managed using emacs.

The WinMove package provides a very nice way of moving around windows
using arrow keys.  But finding an unused key-binding is difficult.
The OpenBox + arrow key commands use <WIN> and Org-Mode uses arrow-key
combination for moving stuff around, setting dates, priorities and
toggling TODO states.

The Buffer-Move package provides a nice way of swaping around buffers
between windows which is bound in this hydra using M-<arrow> keys.

This Hydra provides an interface for splitting windows and moving
between windows using the arrow keys.

The most common use case for this is when I set up a Frame for using
IRC.  Here is an example of the workflow:

  - Create a new frame C-x 5 2 and move it to it's own desktop using
    <WIN> key commands in Openbox.
  - Start IRC with M-x irc, which logs into two different irc servers
    and the Slack irc gateway.  
  - Invoke the Hydra using the keychord '2w' and split the frame up to
    four to six different ways.
  - Use the C-<arrow> keys to move to each window, and M-x b which
    opens the buffer list in Helm and to choose the chat room for each
    window.
  - Press the <SPC> key to exit the Hydra.

This hyra uses the pink /color/ so multiple commands can be invoked in
the hydra without exiting.  If I need to simply split or move between
two window when editing, C-x o and C-x 0 and the C-x 5 commands work
well as one offs.  It's when you have to do a lot of moving and
splitting that this hydra really shines.

The <SPC> spacebar is used to exit the hydra.

#+begin_src emacs-lisp
;; hydra-window --------------------------------------------
;;
;; hydra for managing windows

(defhydra hydra-window (:color pink :hint nil :timeout 20)
  "
         Move                    Resize                      Swap              Split
╭─────────────────────────────────────────────────────────────────────────────────────────┐
         ^_<up>_^                    ^_C-<up>_^                      ^_M-<up>_^            [_v_]ertical
          ^^▲^^                         ^^▲^^                           ^^▲^^              [_h_]orizontal
 _<left>_ ◀   ▶ _<right>_    _C-<left>_ ◀   ▶ _C-<right>_    _M-<left>_ ◀   ▶ _M-<right>_
          ^^▼^^                         ^^▼^^                           ^^▼^^              ╭──────────┐
        ^_<down>_^                  ^_C-<down>_^                    ^_M-<down>_^           quit : [_SPC_]
"
  ("<left>" windmove-left)
  ("<down>" windmove-down)
  ("<up>" windmove-up)
  ("<right>" windmove-right)
  ("h" split-window-below)
  ("v" split-window-right)
  ("C-<up>" hydra-move-splitter-up) 
  ("C-<down>" hydra-move-splitter-down)
  ("C-<left>" hydra-move-splitter-left)
  ("C-<right>" hydra-move-splitter-right)
  ("M-<up>" buf-move-up)
  ("M-<down>" buf-move-down)
  ("M-<left>" buf-move-left)
  ("M-<right>" buf-move-right)
  ("SPC" nil))
#+end_src

#+RESULTS:
:RESULTS:
hydra-window/body
:END:

** Unicode Character Hydra
:PROPERTIES:
:ID:       fa1fe5d0-f511-4d1a-b0ac-4494ad03513c
:END:

Everyone has a set of odd characters they need to insert into
documents from time to time.  I not only write code, but work with a
lot of 19th century scholarly texts.  It was common practice up
through the late 20th century to include quotes in the original greek,
latin, french and german without providing a translation (cheeky
bastards).

European diacritics are easy enough to insert using emacs' C-x 8.  And
Hanzi/Kanji have their own input methods.  But for puncuation
characters and the odd germanic character it's often easier to have a
way of inserting commonly used characters from a memu -- thus this
Hydra.

We have a lot of special purpose hydras for inserting things, but this
is the general catch-all for anything that doesn't fit in it's own
specialized hydra.

This hydra uses the blue /color/ so that when an item is chosen the
character is inserted and the hydra exits.

#+begin_src emacs-lisp
;; hydra unicode -------------------------------------------

(defhydra hydra-unicode (:color blue :hint nil :timeout 20)
  "
                                                                         ╭─────────┐
                                                                         │ Unicode │
 ╭───────────────────────────────────────────────────────────────────────┴─────────╯
  Punctuation:  • [_b_] ★ [_s_] · [_._] — [_-_] ° [_d_]
  Typography :  § [_S_] ¶ [_p_] ※ [_r_] † [_+_] ‡ [_=_] № [_n_] ⁂ [_*_] ╭───────────────────────┐
  Germanic   :  Ð [_E_] ð [_e_] þ [_T_] Þ [_t_]                    Japan: 〇 [_0_] ₸ [_$_]
  Money      :  ¢ [_1_] € [_2_] ฿ [_3_] £ [_4_] ￥ [_5_]              Marks: ® [_6_] ™ [_7_] © [_8_]
 ╭──────────────────────────────────────────────────────┐
  Arrows    :  ← [_<left>_] → [_<right>_] ↑ [_<up>_] ↓ [_<down>_]
"
  ;; Japan
  ("0" (lambda () (interactive) (insert "〇"))) ;; zero
  ("$" (lambda () (interactive) (insert "₸")))  ;; postal mark
  ;; Typoggrphy
  ("b" (lambda () (interactive) (insert "•"))) ;; bullet
  ("+" (lambda () (interactive) (insert "†"))) ;; dagger
  ("=" (lambda () (interactive) (insert "‡"))) ;; double dagger
  ("d" (lambda () (interactive) (insert "°"))) ;; degree
  ("." (lambda () (interactive) (insert "·"))) ;; mid dot
  ("-" (lambda () (interactive) (insert "—"))) ;; em dash
  ("S" (lambda () (interactive) (insert "§"))) ;; Section
  ("s" (lambda () (interactive) (insert "★"))) ;; star
  ("n" (lambda () (interactive) (insert "№"))) ;; numero
  ("*" (lambda () (interactive) (insert "⁂"))) ;; asterism (centered text break)  
  ("p" (lambda () (interactive) (insert "¶"))) ;; pilcrow (paragraph)
  ("r" (lambda () (interactive) (insert "※"))) ;; note
  ;; Germanic 
  ("E" (lambda () (interactive) (insert "Ð"))) ;; eth Uppercase
  ("e" (lambda () (interactive) (insert "ð"))) ;; eth
  ("t" (lambda () (interactive) (insert "Þ"))) ;; thorn
  ("T" (lambda () (interactive) (insert "þ"))) ;; thorn uppercase
  ;; Arrows
  ("<left>"  (lambda () (interactive) (insert "←"))) ;; left arrow
  ("<right>" (lambda () (interactive) (insert "→"))) ;; right arrow
  ("<up>"    (lambda () (interactive) (insert "↑"))) ;; up arrow
  ("<down>"  (lambda () (interactive) (insert "↓"))) ;; down arrow
  ;; Money
  ("1" (lambda () (interactive) (insert "¢"))) ;; cent
  ("2" (lambda () (interactive) (insert "€"))) ;; euro
  ("3" (lambda () (interactive) (insert "฿"))) ;; baht
  ("4" (lambda () (interactive) (insert "£"))) ;; pound
  ("5" (lambda () (interactive) (insert "￥"))) ;; yen
  ;; Marks
  ("6" (lambda () (interactive) (insert "®"))) ;; registered trademark
  ("7" (lambda () (interactive) (insert "™"))) ;; trademark
  ("8" (lambda () (interactive) (insert "©"))) ;; copyright
  ("<SPC>" nil nil))
#+end_src

#+RESULTS:
:RESULTS:
hydra-unicode/body
:END:

** Calendar & Weekdays Hydra
:PROPERTIES:
:ID:       3c1aa21a-b09b-4acf-ac5b-6c64c7e999a4
:END:

This hydra is designed for entering a Hanzi/Kanji date string within
the hydra.  To make this work we explicitly set numbers in the hydra
so that numbers are not treated as prefix arguments -- this might be
something that helm is doing not hydra....

#+begin_example
2017年02月11日 (土)  2017-02-11 (Sat)
#+end_example

The letters used in the hydra to invoke the days of the week
correspond to the english meaning for each character.

  |    | hydra | english   | planet               | meaning              |
  |----+-------+-----------+----------------------+----------------------|
  | 年 | Y     | Year      |                      |                      |
  | 月 | M     | Month     | moon                 | lunar month          |
  | 日 | D     | Day       | sun                  | solar day            |
  | 日 | s     | sunday    | male   陽 yáng, /yō/ | sun                  |
  | 月 | m     | monday    | female 陰 yīn, /in/  | moon                 |
  | 火 | f     | tuesday   | mars                 | fire                 |
  | 水 | w     | wednesday | Mercury              | water                |
  | 木 | t     | thursday  | Jupiter              | tree or wood         |
  | 金 | g     | friday    | Venus                | gold[1]              |
  | 土 | e     | saturday  | earth                | ground/element earth |

[1] Think payday--'the eagle flys on friday'

For more info about Japanese and Chinese weekday names see:
[[http://www.cjvlang.com/Dow/index.html]]

Japanese days of the week can be swapped out for:

Chinese:

   星期日 星期天 星期一 星期二 星期三 星期四 星期五 星期六

English:

   Sun Mon Tue Wed Thu Fri Sat (or euro equiv) 

Personally I think the Chinese names are too long winded, obvious and
boring (numbers 1-6) and the english have lost the associated
mythology and link to the planets that they once had.  That and IMHO
the names are not as elegant or evocative as the Japanese YMMV.

This hydra uses the pink /color/ that doesn't exit until you press
<SPC>. 

#+begin_src emacs-lisp
;; calendar & weekday hydra --------------------------------

;; This hydra is designed for entering a Hanzi/Kanji
;; date string within the hydra.  To make this work we
;; explicitly set numbers in the hydra so that numbers
;; are not treated as prefix arguments -- this might be
;; something that helm is doing not hydra....

(defhydra hydra-calendar (:color pink :hint nil)
  "
                                                                ╭──────────┐
                                                                │ Calendar │
 ╭──────────────────────────────────────────────────────────────┴──────────╯
  Calendar  :  年 [_Y_] 月 [_M_] 日 [_D_]
  Weekdays  :  (日) [_s_] (月) [_m_] (火) [_f_] (水) [_w_] (木) [_t_] (金) [_g_] (土) [_e_]
"
  ;; Calendar
  ("Y" (lambda () (interactive) (insert "年"))) ;; year
  ("M" (lambda () (interactive) (insert "月"))) ;; moon/month
  ("D" (lambda () (interactive) (insert "日"))) ;; day/sun
  ;; Weekdays
  ("s" (lambda () (interactive) (insert " (日)"))) ;; sunday sun
  ("m" (lambda () (interactive) (insert " (月)"))) ;; monday moon
  ("f" (lambda () (interactive) (insert " (火)"))) ;; tuesday fire
  ("w" (lambda () (interactive) (insert " (水)"))) ;; wednesday water
  ("t" (lambda () (interactive) (insert " (木)"))) ;; thursday wood/tree
  ("g" (lambda () (interactive) (insert " (金)"))) ;; friday gold (payday!)
  ("e" (lambda () (interactive) (insert " (土)"))) ;; saturday earth
  ("0" (lambda () (interactive) (insert "0")))    ;;
  ("1" (lambda () (interactive) (insert "1")))    ;;
  ("2" (lambda () (interactive) (insert "2")))    ;;
  ("3" (lambda () (interactive) (insert "3")))    ;;  set numbers explicitly
  ("4" (lambda () (interactive) (insert "4")))    ;;  so that we can write 
  ("5" (lambda () (interactive) (insert "5")))    ;;  whole date inside hydra
  ("6" (lambda () (interactive) (insert "6")))    ;;
  ("7" (lambda () (interactive) (insert "7")))    ;;
  ("8" (lambda () (interactive) (insert "8")))    ;;
  ("9" (lambda () (interactive) (insert "9")))    ;;
  ("<SPC>" nil nil))
#+end_src
 
** Greek Alphabet Hydra
:PROPERTIES:
:ID:       fc4a9ac3-2e39-444f-8195-1582ef279f43
:END:

This hydra is largely untested, the key-bindings are based on several
key-mappings I used before for greek characters.  I expect to need to
input a number of classical greek quotes in an upcoming project so we
will see how well this works then.  In the mean time, any feedback on
how to improve this would be very welcome.

This is the only hydra where I use <ESC> escape key to exit the
hydra.  This is because both 'q' and <SPC> are used for composing
strings.

#+begin_src emacs-lisp :tangle emacs-hydra.el

;; hydra greek ---------------------------------------------

(defhydra hydra-greek (:color pink :hint nil)
  "
                                                                 ╭───────┐
                                                                 │ Greek │
 ╭───────────────────────────────────────────────────────────────┴───────╯
  α [_a_] β [_b_] Y [_g_] δ [_d_] ε [_e_] ζ [_z_] η [_h_] θ [_q_] ι [_i_] κ [_k_] λ [_l_] μ [_m_]
  ν [_n_] ξ [_x_] ο [_o_] π [_p_] ρ [_r_] σ [_s_] τ [_t_] υ [_u_] φ [_j_] χ [_c_] ψ [_y_] ω [_w_]

  Α [_A_] Β [_B_] Γ [_G_] Δ [_D_] Ε [_E_] Ζ [_Z_] Η [_H_] Θ [_Q_] Ι [_I_] Κ [_K_] Λ [_l_] Μ [_M_]
  Ν [_N_] Ξ [_X_] Ο [_O_] Π [_P_] Ρ [_R_] Σ [_S_] Τ [_T_] Υ [_U_] Φ [_J_] Χ [_C_] Ψ [_Y_] Ω [_W_]
 ╭────────────┐
  Quit  [_<ESC>_]
"
  ("a" (lambda () (interactive) (insert "α")))
  ("b" (lambda () (interactive) (insert "β")))
  ("g" (lambda () (interactive) (insert "γ")))
  ("d" (lambda () (interactive) (insert "δ")))
  ("e" (lambda () (interactive) (insert "ε")))
  ("z" (lambda () (interactive) (insert "ζ")))
  ("h" (lambda () (interactive) (insert "η")))
  ("q" (lambda () (interactive) (insert "θ")))
  ("i" (lambda () (interactive) (insert "ι")))
  ("k" (lambda () (interactive) (insert "κ")))
  ("l" (lambda () (interactive) (insert "λ")))
  ("m" (lambda () (interactive) (insert "μ")))
  ("n" (lambda () (interactive) (insert "ν")))
  ("x" (lambda () (interactive) (insert "ξ")))
  ("o" (lambda () (interactive) (insert "ο")))
  ("p" (lambda () (interactive) (insert "π")))
  ("r" (lambda () (interactive) (insert "ρ")))
  ("s" (lambda () (interactive) (insert "σ")))
  ("t" (lambda () (interactive) (insert "τ")))
  ("u" (lambda () (interactive) (insert "υ")))
  ("f" (lambda () (interactive) (insert "ϕ")))
  ("j" (lambda () (interactive) (insert "φ")))
  ("c" (lambda () (interactive) (insert "χ")))
  ("y" (lambda () (interactive) (insert "ψ")))
  ("w" (lambda () (interactive) (insert "ω")))
  ("A" (lambda () (interactive) (insert "Α")))
  ("B" (lambda () (interactive) (insert "Β")))
  ("G" (lambda () (interactive) (insert "Γ")))
  ("D" (lambda () (interactive) (insert "Δ")))
  ("E" (lambda () (interactive) (insert "Ε")))
  ("Z" (lambda () (interactive) (insert "Ζ")))
  ("H" (lambda () (interactive) (insert "Η")))
  ("Q" (lambda () (interactive) (insert "Θ")))
  ("I" (lambda () (interactive) (insert "Ι")))
  ("K" (lambda () (interactive) (insert "Κ")))
  ("L" (lambda () (interactive) (insert "Λ")))
  ("M" (lambda () (interactive) (insert "Μ")))
  ("N" (lambda () (interactive) (insert "Ν")))
  ("X" (lambda () (interactive) (insert "Ξ")))
  ("O" (lambda () (interactive) (insert "Ο")))
  ("P" (lambda () (interactive) (insert "Π")))
  ("R" (lambda () (interactive) (insert "Ρ")))
  ("S" (lambda () (interactive) (insert "Σ")))
  ("T" (lambda () (interactive) (insert "Τ")))
  ("U" (lambda () (interactive) (insert "Υ")))
  ("F" (lambda () (interactive) (insert "Φ")))
  ("J" (lambda () (interactive) (insert "Φ")))
  ("C" (lambda () (interactive) (insert "Χ")))
  ("Y" (lambda () (interactive) (insert "Ψ")))
  ("W" (lambda () (interactive) (insert "Ω")))
  ("<SPC>" (lambda () (interactive) (insert " ")))
  ("<ESC>" nil nil))

#+end_src

** Math & Logic Hydra
:PROPERTIES:
:ID:       d6da1dad-715f-4392-9103-194e71f76b67
:END:

I typically don't use a lot of math symbols in running text, if I need
to include a formula, LaTex is the way to go.  However, I often use
logic symbols in running text, thus this hydra.

This hydra is blue /color/ so the hydra exits after choosing a key.  
You can explicitly exit the hydra using <SPC> and there is a 30 second
timeout that exits the hydra if nothing is chosen.

#+begin_src emacs-lisp :tangle emacs-hydra.el
;; hydra math & logic --------------------------------------

(defhydra hydra-logic (:color blue :hint nil :timeout 30)
  "
                                                                 ╭───────┐
                                                                 │ Math  │
  ╭──────────────────────────────────────────────────────────────┴───────╯
   ≈ [_1_] ≡ [_2_] ≠ [_3_] ∞ [_4_] × [_5_] ± [_6_] ∓ [_7_] ÷ [_8_] √ [_9_]
                                                                 ╭───────┐
                                                                 │ Logic │
  ╭──────────────────────────────────────────────────────────────┴───────╯
   ∀ [_a_] ∁ [_b_] ∃ [_c_] ∄ [_d_] ∅ [_e_] ¬ [_f_] ∧ [_g_] ∨ [_h_] ∩ [_i_] ∪ [_j_] ∈ [_k_] ∉ [_l_]
   ∋ [_m_] ∌ [_n_] ⊂ [_o_] ⊃ [_p_] ⊄ [_q_] ⊅ [_r_] ⊆ [_s_] ⊇ [_t_] ⊈ [_u_] ⊉ [_v_] ⋄ [_w_]
"
  ;; Math
  ("1" (lambda () (interactive) (insert "≈")))
  ("2" (lambda () (interactive) (insert "≡")))
  ("3" (lambda () (interactive) (insert "≠")))
  ("4" (lambda () (interactive) (insert "∞")))
  ("5" (lambda () (interactive) (insert "×")))
  ("6" (lambda () (interactive) (insert "±")))
  ("7" (lambda () (interactive) (insert "∓")))
  ("8" (lambda () (interactive) (insert "÷")))
  ("9" (lambda () (interactive) (insert "√")))
  ;; Logic
  ("a" (lambda () (interactive) (insert "∀")))
  ("b" (lambda () (interactive) (insert "∁")))
  ("c" (lambda () (interactive) (insert "∃")))
  ("d" (lambda () (interactive) (insert "∄")))
  ("e" (lambda () (interactive) (insert "∅")))
  ("f" (lambda () (interactive) (insert "¬")))
  ("g" (lambda () (interactive) (insert "∧")))
  ("h" (lambda () (interactive) (insert "∨")))
  ("i" (lambda () (interactive) (insert "∩")))
  ("j" (lambda () (interactive) (insert "∪")))
  ("k" (lambda () (interactive) (insert "∈")))
  ("l" (lambda () (interactive) (insert "∉")))
  ("m" (lambda () (interactive) (insert "∋")))
  ("n" (lambda () (interactive) (insert "∌")))
  ("o" (lambda () (interactive) (insert "⊂")))
  ("p" (lambda () (interactive) (insert "⊃")))
  ("q" (lambda () (interactive) (insert "⊄")))
  ("r" (lambda () (interactive) (insert "⊅")))
  ("s" (lambda () (interactive) (insert "⊆")))
  ("t" (lambda () (interactive) (insert "⊇")))
  ("u" (lambda () (interactive) (insert "⊈")))
  ("v" (lambda () (interactive) (insert "⊉")))
  ("w" (lambda () (interactive) (insert "⋄")))
  ("<SPC>" nil nil))
#+end_src

** Twittering Mode Hydra
:PROPERTIES:
:ID:       11576448-ea21-41b0-bad3-b609201eb5f1
:END:

I tend to use Twitter in bursts, and even then, mostly when I tweet
breaking news that is happening in Cambodia.  The noise level on
Twitter is annoying, and the tendency for many people to include an
image for /every/ tweet they send greatly reduces its utility for me.
So Twittering mode is a great way of using twitter without being
bombarded with every bloody cat picture or whatever they are eating
for lunch.  A couple of years ago I unsubbed from anyone who used the
an annoying adjective like "yummy" together with "veggie" together
with some kind of food, as in "I just had a yummy veggie pizza".  Food
should not be a fetish or an ideology.

This wonderful hydra was taken from the Hydra wiki, and was an
inspiration for how creative and powerful /hints/ can be.  I've see
other hydras that have obviously been inspired by this hydra as well.

Twittering mode has a lot of commands, and I always forget how to
retweet follow links and look up profiles.  This hyra is the perfect
cheat sheet for the occasional user to get the most out of Twittering
Mode.

#+begin_src emacs-lisp
;; hydra twittering ----------------------------------------

(defhydra hydra-twittering (:color blue :hint nil  :timeout 10)
        "
                                                                    ╭────────────┐
     Tweets                User                        Timeline     │ Twittering │
  ╭─────────────────────────────────────────────────────────────────┴────────────╯
    _k_  [_t_] post tweet      _p_  [_f_] follow                  ^_g_^      [_u_] update
    ^↑^  [_X_] delete tweet    ^↑^  [_F_] unfollow              ^_S-SPC_^    [_._] new
    ^ ^  [_r_] retweet         ^ ^  [_d_] direct message          ^^↑^^      [^@^] current user
    ^↓^  [_R_] retweet & edit  ^↓^  [_i_] profile (browser)   _h_ ←   → _l_  [_a_] toggle
    _j_  [_b_] favorite        _n_   ^ ^                          ^^↓^^
    ^ ^  [_B_] unfavorite      ^ ^   ^ ^                         ^_SPC_^
    ^ ^  [_RET_] reply         ^ ^   ^ ^                          ^_G_^
    ^ ^  [_T_] show Thread
    ^ ^  [_y_] yank url          Items                     Do
    ^ ^  [_Y_] yank tweet     ╭───────────────────────────────────────────────────────
    ^ ^  [_e_] edit mode        _<backtab>_ ← _o_pen → _<tab>_    [_q_] exit
    ^ ^   ^ ^                   ^         ^   ^ ^      ^     ^    [_/_] search
  --------------------------------------------------------------------------------
       "
       ("\\" hydra-master/body "back")
       ("<ESC>" nil "quit")
       ("q"          twittering-kill-buffer)
       ("e"          twittering-edit-mode)
       ("j"          twittering-goto-next-status :color red)
       ("k"          twittering-goto-previous-status :color red)
       ("h"          twittering-switch-to-next-timeline :color red)
       ("l"          twittering-switch-to-previous-timeline :color red)
       ("g"          beginning-of-buffer)
       ("G"          end-of-buffer)
       ("t"          twittering-update-status-interactive)
       ("X"          twittering-delete-status)
       ("RET"        twittering-reply-to-user)
       ("r"          twittering-native-retweet)
       ("R"          twittering-organic-retweet)
       ("d"          twittering-direct-message)
       ("u"          twittering-current-timeline)
       ("b"          twittering-favorite)
       ("B"          twittering-unfavorite)
       ("f"          twittering-follow)
       ("F"          twittering-unfollow)
       ("i"          twittering-view-user-page)
       ("/"          twittering-search)
       ("."          twittering-visit-timeline)
       ("@"          twittering-other-user-timeline)
       ("T"          twittering-toggle-or-retrieve-replied-statuses)
       ("o"          twittering-click)
       ("<tab>"        twittering-goto-next-thing :color red)
       ("<backtab>"  twittering-goto-previous-thing :color red)
       ("n"          twittering-goto-next-status-of-user :color red)
       ("p"          twittering-goto-previous-status-of-user :color red)
       ("SPC"        twittering-scroll-up :color red)
       ("S-SPC"      twittering-scroll-down :color red)
       ("y"          twittering-push-uri-onto-kill-ring)
       ("Y"          twittering-push-tweet-onto-kill-ring)
       ("a"          twittering-toggle-activate-buffer))
#+end_src

** Rectangle Mode Hydra
:PROPERTIES:
:ID:       30fe57f8-112b-4a4c-b910-cb0f2e457d90
:END:

Emacs rectangle editing is one of the things that sets emacs apart
from nearly any other tool.  I don't rectangles that often but when I
do they save a significant amount of time

This hydra was another gem from the hydra wiki. See: 

  - [[http://oremacs.com/2015/02/25/rectangle-hydra/]]
  - [[http://cestlaz.github.io/posts/using-emacs-27-rectangles/#.WJ542LMxVpi]]

The author sez the ascii art in the hydra is a cat, but to me it looks
more like the Cat Bus in Totorro :)

#+begin_src emacs-lisp
;; hydra rectangle -----------------------------------------
;;
;; rectangle editing is very cool, but it's one of those
;; things you use seldom enough that you can't remember
;; the commands.  The hydra makes all of that go away....
;
;; See: http://oremacs.com/2015/02/25/rectangle-hydra/
;;      http://cestlaz.github.io/posts/using-emacs-27-rectangles/#.WJ542LMxVpi

(defhydra hydra-rectangle (:body-pre (rectangle-mark-mode 1)
                           :color pink
                           :post (deactivate-mark)
			   :timeout 30)
  "
  ^_k_^     _d_elete    _s_tring     |\\     ‗,,,--,,‗
_h_   _l_   _o_k        _y_ank       /,`.-'`'   .‗  \-;;,‗
  ^_j_^     _n_ew-copy  _r_eset     |,4-  ) )‗   .;.(  `'-'
^^^^        _e_xchange  _u_ndo     '---''(‗/.‗)-'(‗\‗)
^^^^        ^ ^         _p_aste
"
  ("h" backward-char nil)
  ("l" forward-char nil)
  ("k" previous-line nil)
  ("j" next-line nil)
  ("e" ora-ex-point-mark nil)
  ("n" copy-rectangle-as-kill nil)
  ("d" delete-rectangle nil)
  ("r" (if (region-active-p)
           (deactivate-mark)
         (rectangle-mark-mode 1)) nil)
  ("y" yank-rectangle nil)
  ("u" undo nil)
  ("s" string-rectangle nil)
  ("p" kill-rectangle nil)
  ("o" nil nil))

(global-set-key (kbd "C-x SPC") 'hydra-rectangle/body)
#+end_src

** Hydra Join Lines (placeholder)
:PROPERTIES:
:ID:       822f82b0-4fd1-4be4-a3c8-249896820a9f
:END:

This hydra is from the Hydra Wiki.  Still needs to be integrated into
my workflow.

#+begin_src emacs-lisp
;; hydra join lines ----------------------------------------

(defhydra hydra-join-lines (:timeout 5)
  ("<up>" join-line)
  ("<down>" (join-line 1))
  ("t" join-line)
  ("n" (join-line 1))
  ("<SPC>" nil nil))
#+end_src

** Emacs Transpose (placeholder)
:PROPERTIES:
:ID:       6c000ad7-94ee-43a7-aade-84b9839895fc
:END:

This hydra is from the Hydra Wiki.  Good stuff, but still not sure how
I'm going to integrate.

#+begin_src emacs-lisp
;; hydra transpose ------------------------------------------

(defhydra hydra-transpose (:color red  :timeout 5)
    "Transpose"
    ("c" transpose-chars "characters")
    ("w" transpose-words "words")
    ("o" org-transpose-words "Org mode words")
    ("l" transpose-lines "lines")
    ("s" transpose-sentences "sentences")
    ("e" org-transpose-elements "Org mode elements")
    ("p" transpose-paragraphs "paragraphs")
    ("t" org-table-transpose-table-at-point "Org mode table")
    ("q" nil "cancel" :color blue))


(defun ora-ex-point-mark ()
  (interactive)
  (if rectangle-mark-mode
      (exchange-point-and-mark)
    (let ((mk (mark)))
      (rectangle-mark-mode 1)
      (goto-char mk))))
#+end_src

** Elfeed Hydra
:PROPERTIES:
:ID:       c2878059-5d4e-4e8f-a0dd-1559df7dfb39
:END:

Hydra for the elfeed news reader.


#+begin_src emacs-lisp

;; hydra-elfeed ---------------------------------------------

(defhydra hydra-elfeed (:color blue :hint nil)
   "
                                                                   ╭─────────┐
                                                                   │ Elfeed  │
 ╭───────────────────────────────────────────────────────────┬─────┴─────────╯
  Tags :      Torrents [_d_] Comics [_C_] Emacs [_e_| Tech [_t_]     |       All [_A_]  
               Science [_s_] Space  [_S_]                        |
 ╭───────────────────────────────────────────────────────────┤     Today [_T_]  
  Feeds: Boing Boing [_b_] Slashdot [_/_]   Ars Technica [_a_]     │   Starred [_*_]  
          Cool Tools [_o_]    Codex [_c_]   YouTube      [_y_]     │    Marked [_M_]
              Robots [_r_]    Wired [_w_]   Future       [_f_]     │
 ╭───────────────────────────────────────────────────────────┘ Quit/Save [_q_]
  Quit [_<SPC>_]
"
   ("C" (elfeed-search-set-filter "@1-months-ago  +unread  +comic"))
   ("e" (elfeed-search-set-filter "@1-months-ago  +unread  +emacs"))
   ("t" (elfeed-search-set-filter "@1-months-ago  +unread  +tech"))
   ("s" (elfeed-search-set-filter "@1-months-ago  +unread  +sci"))
   ("S" (elfeed-search-set-filter "@1-months-ago  +unread  +space"))
   ("b" (elfeed-search-set-filter "@1-months-ago  +unread  +boing"))
   ("/" (elfeed-search-set-filter "@1-months-ago  +unread  +slash"))
   ("a" (elfeed-search-set-filter "@1-months-ago  +unread  +ars"))
   ("d" (elfeed-search-set-filter "@1-months-ago  +unread  +torrent"))
   ("c" (elfeed-search-set-filter "@1-months-ago  +unread  +codex"))
   ("o" (elfeed-search-set-filter "@1-months-ago  +unread  +tools"))
   ("p" (elfeed-search-set-filter "@1-months-ago  +unread  +planet"))
   ("r" (elfeed-search-set-filter "@1-months-ago  +unread  +robot"))
   ("f" (elfeed-search-set-filter "@1-months-ago  +unread  +future"))
   ("y" (elfeed-search-set-filter "@1-months-ago  +unread  +youtube"))
   ("w" (elfeed-search-set-filter "@1-months-ago  +unread  +wired"))

   ("*" (elfeed-search-set-filter "@1-months-ago +star"))
   ("M" elfeed-toggle-star nil)
   ("A" (elfeed-search-set-filter "@1-months-ago +unread"))
   ("T" (elfeed-search-set-filter "@2-day-ago    +unread"))
   ("q" bjm/elfeed-save-db-and-bury nil :color blue)
   ("<SPC>" nil nil))
#+end_src

#+RESULTS:
:RESULTS:
hydra-elfeed/body
:END:

** Badge Hydra
:PROPERTIES:
:ID:       da60e1c6-55dd-4064-bdeb-be5789358958
:END:

Used for inserting badges into project files.  This is designed to
work closely with my yassnippet templates.

#+begin_src emacs-lisp

;; hydra-badge ------------------------------------------------

(defhydra hydra-badge (:color pink :hint nil :timeout 20)
  "
                                                                         ╭─────────┐
                                                                         │ Badges  │
 ╭───────────────────────────────────────────────────────────────────────┴─────────╯
  Misc     :  chenla  [_m_]   deerpig [_d_]   licence [_l_]

  Class  :  primer   [_cp_]  deploy  [_cd_]  project  [_cj_]  docs  [_cm_]

  Type   :  tl;dr    [_tt_]  pattern [_ta_]  place    [_tg_]  event [_te_]  README  [_tr_]
            person   [_tp_]  concept [_tc_]  material [_tm_]  blob  [_tb_]  TOC     [_to_]
            work     [_tw_]  exp     [_tx_]  man      [_tn_]  item  [_ti_]  runbook [_tb_]

  Status :  stub     [_ss_]  wip     [_sw_]  draft    [_sd_]  rfc   [_sr_]  release [_sv_]

  Issue   : bug      [_ib_]  feature [_if_]  request  [_ir_]  wish [_iw_] 
            moonshot [_im_]

  Tag    :  tag      [_g_]
"

;; Misc
("d"  (lambda () (interactive) (insert "[[https://img.shields.io/badge/made%20by-Deerpig-999999.svg?style=flat-square]]"))) ;; made-by deerpig
("m"  (lambda () (interactive) (insert "[[https://img.shields.io/badge/made%20by-Chenla%20Institute-999999.svg?style=flat-square]]"))) ;; made-by chenla
("l"  (lambda () (interactive) (insert "[[https://img.shields.io/badge/licence-MIT%2FCC%20BY--SA%204.0-000000.svg?style=flat-square]]"))) ;; licence
;; Class 
("cp" (lambda () (interactive) (insert "[[https://img.shields.io/badge/class-primer-56B4E9.svg?style=flat-square]]")))  ;; primer
("cd" (lambda () (interactive) (insert "[[https://img.shields.io/badge/class-deploy-0072B2.svg?style=flat-square]]")))  ;; deploy
("cj" (lambda () (interactive) (insert "[[https://img.shields.io/badge/class-project-D55E00.svg?style=flat-square]]"))) ;; project
("cm" (lambda () (interactive) (insert "[[https://img.shields.io/badge/class-docs-56B4E9.svg?style=flat-square]]")))    ;; docs
;; Type
("tt" (lambda () (interactive) (insert "[[https://img.shields.io/badge/type-tl;dr-0072B2.svg?style=flat-square]]")))    ;; tl;dr
("ta" (lambda () (interactive) (insert "[[https://img.shields.io/badge/type-pattern-0072B2.svg?style=flat-square]]")))  ;; pattern
("tg" (lambda () (interactive) (insert "[[https://img.shields.io/badge/type-place-0072B2.svg?style=flat-square]]")))    ;; place
("te" (lambda () (interactive) (insert "[[https://img.shields.io/badge/type-event-0072B2.svg?style=flat-square]]")))    ;; event
("tp" (lambda () (interactive) (insert "[[https://img.shields.io/badge/type-person-0072B2.svg?style=flat-square]]")))   ;; person
("tc" (lambda () (interactive) (insert "[[https://img.shields.io/badge/type-concept-0072B2.svg?style=flat-squae]]")))   ;; concept
("tm" (lambda () (interactive) (insert "[[https://img.shields.io/badge/type-material-0072B2.svg?style=flat-square]]"))) ;; material
("tb" (lambda () (interactive) (insert "[[https://img.shields.io/badge/type-blob-0072B2.svg?style=flat-square]]")))     ;; blob
("to" (lambda () (interactive) (insert "[[https://img.shields.io/badge/type-TOC-0072B2.svg?style=flat-square]]")))      ;; TOC
("tr" (lambda () (interactive) (insert "[[https://img.shields.io/badge/type-readme-0072B2.svg?style=flat-square]]")))   ;; README
("tw" (lambda () (interactive) (insert "[[https://img.shields.io/badge/type-work-0072B2.svg?style=flat-square]]")))          ;; Work
("tb" (lambda () (interactive) (insert "[[https://img.shields.io/badge/type-runbook-0072B2.svg?style=flat-square]]")))       ;; Runbook
("tx" (lambda () (interactive) (insert "[[https://img.shields.io/badge/type-expresssion-0072B2.svg?style=flat-square]]")))   ;; Expression
("tn" (lambda () (interactive) (insert "[[https://img.shields.io/badge/type-manifestation-0072B2.svg?style=flat-square]]"))) ;; Manifestation
("ti" (lambda () (interactive) (insert "[[https://img.shields.io/badge/type-instance-0072B2.svg?style=flat-square]]")))      ;; Instance
;; Tag
("g"  (lambda () (interactive) (insert "[[https://img.shields.io/badge/tag-v1.0.1-0072B2.svg?style=flat-square]]")))      ;; tag 
;; Issue Type
("ib" (lambda () (interactive) (insert "[[https://img.shields.io/badge/issue-bug-CC79A7.svg?style=flat-square]]")))        ;; bug
("if" (lambda () (interactive) (insert "[[https://img.shields.io/badge/issue-feature-D55E00.svg?style=flat-square]]")))    ;; feature
("ir" (lambda () (interactive) (insert "[[https://img.shields.io/badge/issue-request-56B4E9.svg?style=flat-square]]")))    ;; request
("iw" (lambda () (interactive) (insert "[[https://img.shields.io/badge/issue-wish-D55E00.svg?style=flat-square]]")))       ;; wish
("im" (lambda () (interactive) (insert "[[https://img.shields.io/badge/issue-moonshot-999999.svg?style=flat-square]]")))   ;; moonshot
;; Status
("ss" (lambda () (interactive) (insert "[[https://img.shields.io/badge/status-stub-CC79A7.svg?style=flat-square]]")))      ;; stub
("sw" (lambda () (interactive) (insert "[[https://img.shields.io/badge/status-wip-D55E00.svg?style=flat-square]]")))       ;; wip
("sd" (lambda () (interactive) (insert "[[https://img.shields.io/badge/status-draft-E69F00.svg?style=flat-square]]")))     ;; draft
("sr" (lambda () (interactive) (insert "[[https://img.shields.io/badge/status-rfc-009E73.svg?style=flat-square]]")))       ;; rfc
("sv" (lambda () (interactive) (insert "[[https://img.shields.io/badge/status-release-0072B2.svg?style=flat-square]]")))   ;; release
("<SPC>" nil nil))

#+end_src

#+RESULTS:
:RESULTS:
hydra-badge/body
:END:

** Org-Mode Hydra
:PROPERTIES:
:ID:       deece4aa-a396-49d7-b433-dcdd8c0a1f83
:END:

Once a upon a time, more than a year ago, I took a part-time
gig where at least in the beginning it looked like a good
idea to keep tabs on how much time I was spending on
different projects.  Turned out they didn't really give a
shit, but it did teach me how useful org-clock is.  It also
taught me that I would never remember the key-bindings for
using it unless I used it every day.  This neat little Hydra
from Marcin Borkowski will ensure that if I need to use
org-clock it's the learning curve is already in place.

Snarfed from:
 
  [[http://mbork.pl/2018-03-18_My_Org-mode_hydra][Marcin Borkowski: 2018-03-18 My Org-mode hydra]]

#+begin_src emacs-lisp

;; hydra-org ----------------------------------------------------

(defhydra hydra-org (:color pink :timeout 12 :hint nil)
  "
                                                                      ╭──────────┐
                                                                      │ Org Mode │
 ╭────────────────────────────────────────────────────────────────────┴──────────╯

  Clock In  [_i_]  Cancel a clock [_q_]  Go to a clock [_j_] Clock in last task [_<f10>_]
  Clock Out [_o_]  Create TODO    [_m_]                                  Quit [_<SPC>_] 
"
  ("i" (lambda () (interactive) (org-clock-in '(4))))
  ("o" org-clock-out)
  ("q" org-clock-cancel )
  ("<f10>" org-clock-in-last )
  ("j" (lambda () (interactive) (org-clock-goto '(4))) ) 
  ("m" make-this-message-into-an-org-todo-item )
  ("<SPC>" nil nil))


#+end_src

#+RESULTS:
:RESULTS:
hydra-org/body
:END:


** PDF-Tool Hydra
:PROPERTIES:
:ID:       a769e327-b6f5-4f32-b2bd-3e341bd267f1
:END:

No surprise that this came from the ever prolific Abo-Abo:

   https://github.com/abo-abo/hydra/wiki/PDF-Tools

#+begin_src emacs-lisp

;; PDF-Tools Hydra -----------------------------------------------------

(defhydra hydra-pdftools (:color blue :hint nil)
        "
                                                                      ╭───────────┐
       Move  History   Scale/Fit     Annotations  Search/Link    Do   │ PDF Tools │
   ╭──────────────────────────────────────────────────────────────────┴───────────╯
         ^^_g_^^      _B_    ^↧^    _+_    ^ ^     [_al_] list    [_s_] search    [_u_] revert buffer
         ^^^↑^^^      ^↑^    _H_    ^↑^  ↦ _W_ ↤   [_am_] markup  [_o_] outline   [_i_] info
         ^^_p_^^      ^ ^    ^↥^    _0_    ^ ^     [_at_] text    [_F_] link      [_d_] dark mode
         ^^^↑^^^      ^↓^  ╭─^─^─┐  ^↓^  ╭─^ ^─┐   [_ad_] delete  [_f_] search link
    _h_ ←pag_e_→ _l_  _N_  │ _P_ │  _-_    _b_     [_aa_] dired
         ^^^↓^^^      ^ ^  ╰─^─^─╯  ^ ^  ╰─^ ^─╯   [_y_]  yank
         ^^_n_^^      ^ ^  _r_eset slice box
         ^^^↓^^^
         ^^_G_^^
   --------------------------------------------------------------------------------
        "
        ("\\" hydra-master/body "back")
        ("<ESC>" nil "quit")
        ("al" pdf-annot-list-annotations)
        ("ad" pdf-annot-delete)
        ("aa" pdf-annot-attachment-dired)
        ("am" pdf-annot-add-markup-annotation)
        ("at" pdf-annot-add-text-annotation)
        ("y"  pdf-view-kill-ring-save)
        ("+" pdf-view-enlarge :color red)
        ("-" pdf-view-shrink :color red)
        ("0" pdf-view-scale-reset)
        ("H" pdf-view-fit-height-to-window)
        ("W" pdf-view-fit-width-to-window)
        ("P" pdf-view-fit-page-to-window)
        ("n" pdf-view-next-page-command :color red)
        ("p" pdf-view-previous-page-command :color red)
        ("d" pdf-view-dark-minor-mode)
        ("b" pdf-view-set-slice-from-bounding-box)
        ("r" pdf-view-reset-slice)
        ("g" pdf-view-first-page)
        ("G" pdf-view-last-page)
        ("e" pdf-view-goto-page)
        ("o" pdf-outline)
        ("s" pdf-occur)
        ("i" pdf-misc-display-metadata)
        ("u" pdf-view-revert-buffer)
        ("F" pdf-links-action-perfom)
        ("f" pdf-links-isearch-link)
        ("B" pdf-history-backward :color red)
        ("N" pdf-history-forward :color red)
        ("l" image-forward-hscroll :color red)
        ("h" image-backward-hscroll :color red))


#+end_src

#+RESULTS:
:RESULTS:
hydra-pdftools/body
:END:

** Hydra Timestamps
:PROPERTIES:
:ID:       a93376e5-f89e-46a1-b34a-e462b6496254
:END:

Adapted from:

https://www.wisdomandwonder.com/article/10763/emacsorg-mode-hydra-to-insert-timestamps


#+begin_src emacs-lisp
(defhydra help/hydra/timestamp (:color blue :hint nil)
  "
                                                         ╭────────────┐
                                                         │ Timestamps │
 ╭───────────────────────────────────────────────────────┴────────────╯
                                                         Quit [_<SPC>_] 
  ISO         : date [_d_]  
  U.S.        : date [_/_]  year   [_y_] dashes [_-_]  words [_w_]
  Stamp       : UTC  [_s_]  human  [_h_]
  Epoch       : unix [_u_]  J2000  [_m_] geo    [_g_] 
  Org Active  : date [_a_]  pick   [_p_]
  Org Inactive: date [_i_]  choose [_c_]
"
  ("d" help/insert-datestamp)                         ; 2018-05-12
  ("/" help/insert-datestamp-us)                      ; 05/12/18 
  ("y" help/insert-datestamp-us-full-year)            ; 05/12/2018
  ("-" help/insert-datestamp-us-full-year-and-dashes) ; 05-12-2018
  ("w" help/insert-datestamp-us-words)                ; Saturday May 12, 2018

  ("s" help/insert-timestamp)                         ; 2018-05-12T11:50:01+07:00
  ("h" help/insert-human-stamp) ; 2018-05-12T12:36@Prek Leap (11.642600N-104.919210W)

  ("u" help/insert-unix-time)                         ; 1526100829
  ("m" insert-epoch)                                  ; 579372688.143557080
  ("g" help/insert-utm)                               ; 48P-491193-1287029-15

  ("a" help/org-time-stamp-with-seconds-now)          ; <2018-05-12 Sat 11:50>
  ("p" org-time-stamp)
  ("i" help/org-time-stamp-inactive-with-seconds-now) ; [2018-05-12 Sat 11:50]
  ("c" org-time-stamp-inactive)
  ("<SPC>" nil))

;;(global-set-key (kbd "C-t") #'help/hydra/timestamp/body)

(defun help/insert-datestamp ()
  "Produces and inserts a partial ISO 8601 format timestamp."
  (interactive)
  (insert (format-time-string "%F")))

(defun help/insert-datestamp-us ()
  "Produces and inserts a US datestamp."
  (interactive)
  (insert (format-time-string "%m/%d/%y")))

(defun help/insert-datestamp-us-full-year-and-dashes ()
  "Produces and inserts a US datestamp with full year and dashes."
  (interactive)
  (insert (format-time-string "%m-%d-%Y")))

(defun help/insert-datestamp-us-full-year ()
  "Produces and inserts a US datestamp with full year."
  (interactive)
  (insert (format-time-string "%m/%d/%Y")))

(defun help/insert-datestamp-us-words ()
  "Produces and inserts a US datestamp using words."
  (interactive)
  (insert (format-time-string "%A %B %d, %Y")))

(defun help/insert-timestamp-no-colons ()
  "Inserts a full ISO 8601 format timestamp with colons replaced by hyphens."
  (interactive)
  (insert (help/get-timestamp-no-colons)))

(defun help/insert-datestamp ()
  "Produces and inserts a partial ISO 8601 format timestamp."
  (interactive)
  (insert (format-time-string "%F")))

(defun help/insert-unix-time ()
  "Produce seconds since 1970-01-01 00:00:00 UTC"
  (interactive) 
  (insert (format-time-string "%s")))

;; insert-epoch seconds.microseconds from year 2000

(defun help/insert-utm ()
 "Insert location in UTM"
 (interactive)
 (insert user-work-utm))

(defun help/insert-human-stamp ()
  "insert human readable time and place stamp"
  (interactive)
(insert
  (concat 
     (format-time-string "%Y-%02m-%02dT%02H:%02M")
     human-readable-stamp)))


(defun help/get-timestamp ()
  "Produces a full ISO 8601 format timestamp."
  (interactive)
  (let* ((timestamp-without-timezone (format-time-string "%Y-%m-%dT%T"))
         (timezone-name-in-numeric-form (format-time-string "%z"))
         (timezone-utf-offset
          (concat (substring timezone-name-in-numeric-form 0 3)
                  ":"
                  (substring timezone-name-in-numeric-form 3 5)))
         (timestamp (concat timestamp-without-timezone
                            timezone-utf-offset)))
    timestamp))

(defun help/insert-timestamp ()
  "Inserts a full ISO 8601 format timestamp."
  (interactive)
  (insert (help/get-timestamp)))

(defun help/org-time-stamp-with-seconds-now ()
  (interactive)
  (let ((current-prefix-arg '(16)))
    (call-interactively 'org-time-stamp)))

(defun help/org-time-stamp-inactive-with-seconds-now ()
  (interactive)
  (let ((current-prefix-arg '(16)))
    (call-interactively 'org-time-stamp-inactive)))

#+end_src

#+RESULTS:
:RESULTS:
help/org-time-stamp-inactive-with-seconds-now
:END:


** Macron Hydra
:PROPERTIES:
:ID:       f6f4f5d3-41f5-4a5f-b7a7-2123cf264c4f
:END:

#+begin_src emacs-lisp
(defhydra hydra-macron (:color blue :hint nil)
  "
                                                                ╭────────┐
                                                                │ Macron │
 ╭──────────────────────────────────────────────────────────────┴────────╯
  ā [_a_] ē [_e_] ī [_i_] ō [_o_] ū [_u_]
  Ā [_A_] Ē [_E_] Ī [_I_] Ō [_O_] Ū [_U_]                   Quit [_<SPC>_]
"
  ("a" (lambda () (interactive) (insert "ā")))
  ("e" (lambda () (interactive) (insert "ē")))
  ("i" (lambda () (interactive) (insert "ī")))
  ("o" (lambda () (interactive) (insert "ō")))
  ("u" (lambda () (interactive) (insert "ū")))
  ("A" (lambda () (interactive) (insert "Ā")))
  ("E" (lambda () (interactive) (insert "Ē")))
  ("I" (lambda () (interactive) (insert "Ī")))
  ("O" (lambda () (interactive) (insert "Ō")))
  ("U" (lambda () (interactive) (insert "Ū")))
  ("<SPC>" nil))
#+end_src 


